docs/pages/algorithm/offline.html
---
layout: default
title: Math
nav_exclude: true
---
<div id="outline-container-orgb8fd6f3" class="outline-2">
<h2 id="orgb8fd6f3"><span class="section-number-2">1.</span> Description</h2>
<div class="outline-text-2" id="text-1">
<p>
An offline algorithm is an algorithm that processes all input data at once, making decisions based on the complete dataset before producing any output.
</p>

<p>
Use an offline algorithm when:
</p>
<ol class="org-ol">
<li>You&rsquo;re given the entire input up front and you&rsquo;re allowed to process it all at once.</li>
<li>You can reorder, sort, or batch the input to optimize performance.</li>
<li>You&rsquo;re solving problems like range queries, event merging, or multiple queries on static data.</li>
<li>You want to preprocess the input and answer many queries efficiently.</li>
</ol>
</div>
</div>
